# File      : memo.org
# Created   : <2020-01-12 Sun 21:22:32 GMT>
# Modified  : <2020-02-15 Sat 09:58:36 GMT> #Rλatan
# Author    : #Rλatan
# Synopsis  : <>

*** Actions
Variable Initialization and stepping clauses, they provide iteration control

~:for~ ~:as~
~:with~
~:repeat~
~:and~

#+begin_src lisp
(loop :for var ...)
(loop :as var ...)
(loop :with var ...)
#+end_src

~LOOP~ may have as many ~:for~ or ~:as~ clouse as you need, iteration will stop as soon as it
finishs longest of them (shortes?)

#+begin_src lisp :results replace raw :exports both
(loop
  :for (a b) :in '((1 2 3) (4 5 6) (7 8 9))
  :append (list a b) :into result
  :finally (return result))
#+end_src

#+RESULTS:
(1 2 4 5 7 8)

#+begin_src lisp :results replace raw :exports both
#+end_src

~:to~ ~:upto~ ~:below~ ~:downto~ ~:above~ ~:downfrom~

#+begin_example
(loop :for var :from start-number :to end-number ...)
(loop :for var :from start-number :upto end-number ...)
(loop :for var :downfrom start-number :to end-number ...)
#+end_example


#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :as i :upto 10
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(0 1 2 3 4 5 6 7 8 9 10)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :upto 10
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(0 1 2 3 4 5 6 7 8 9 10)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :upto 10
  :for j := (* i i)
  :collect (list i j))
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
((0 0) (1 1) (2 4) (3 9) (4 16) (5 25) (6 36) (7 49) (8 64) (9 81) (10 100))
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :upto 10
  :for j := (* i i)
  :for k := (* j j)
  :collect (list i j k))
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
((0 0 0) (1 1 1) (2 4 16) (3 9 81) (4 16 256) (5 25 625) (6 36 1296)
 (7 49 2401) (8 64 4096) (9 81 6561) (10 100 10000))
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :from 0 :downto -10
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(0 -1 -2 -3 -4 -5 -6 -7 -8 -9 -10)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :from 10 :to 20
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(10 11 12 13 14 15 16 17 18 19 20)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :from 20 :to 10
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
NIL
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :from 20 :downto 10
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(20 19 18 17 16 15 14 13 12 11 10)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :downfrom 20 :to 10
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(20 19 18 17 16 15 14 13 12 11 10)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :repeat 10
  :do (print "hello world"))
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
NIL
#+end_EXPORT

Looping over collections (list, string, array, hash table, package)

~:in~ ~:on~ ~:by~
~:across~
~:being~ ~:the~ ~:each~ ~:of~ ~:using~

#+begin_example
(loop :for var :in list-form)
(loop :for var :on list-form ...)
(loop :for var :on list-form :by #'any-list-function ...)
(loop :for var :accross "string" ...)
(loop :for var :accross #(bit-vector) ...)
(loop :for var :being :the things :in hash-or-package ...)
#+end_example

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :in (list 1 2 3 4 5 6 7 8 9)
  :collect (* i 2))
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(2 4 6 8 10 12 14 16 18)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :on (list 1 2 3 4 5 6 7 8 9)
  :collect i)
#+end_src

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :on (list 1 2 3 4 5 6 7 8 9) by #'cddr
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
((1 2 3 4 5 6 7 8 9) (3 4 5 6 7 8 9) (5 6 7 8 9) (7 8 9) (9))
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :across "hello world"
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(#\h #\e #\l #\l #\o #\  #\w #\o #\r #\l #\d)
#+end_EXPORT

#+begin_src lisp :results replace raw :wrap EXPORT markdown :exports both
(loop
  :for i :across #(h e l l o w o r l d)
  :collect i)
#+end_src

#+RESULTS:
#+begin_EXPORT markdown
(H E L L O W O R L D)
#+end_EXPORT

Local variable
~:with~
#+begin_src lisp :results replace raw :exports both
(loop
  :for i :from 1 :to 10
  :with j := (* i 2)
  :collect j)
#+end_src

#+RESULTS:
(2 2 2 2 2 2 2 2 2 2)

#+begin_src lisp :results replace output :exports both
(loop
      :for (item . rest) :on (list 1 2 3 4 5 6 7 8 9 10)
      :do (format t "~a" item)
      :when rest :do (format t ", "))
#+end_src

#+RESULTS:
: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10

Value accumulation

~:collect~ ~:append~ ~:nconc~ ~:count~ ~:sum~ ~:maximize~ ~:minimize~
~:collecting~ ~:appending~ ~:nconcing~ ~:counting~ ~:summing~ ~:maximizing~ ~:minimizing~
~:into~
~:finally~

#+begin_src lisp :results replace output raw :exports both
(defparameter *random* (loop :repeat 100 :collect (random 10000)))

(defparameter example
  (loop
    :for i :in *random*
    :count (evenp i) :into evens
    :count (oddp i) :into odds
    :sum i :into total
    :maximize i :into max
    :minimize i :into min
    :finally (return (list min max total evens odds))))

(format t "~a" example)
#+end_src

#+RESULTS:
(19 9943 506789 51 49)

Uncoditional Execution

~:do~
~:doing~
~:return~ ~:return-from~

#+begin_src lisp :results replace output :exports both
(loop
  :for i :from 1 :to 10
  :do (print i))
#+end_src

#+RESULTS:
#+begin_example
1
2
3
4
5
6
7
8
9
10
#+end_example

#+begin_src lisp :results replace raw output :exports both
(block outer
  (loop :for i :from 0 :return 100)
  (print "will be skipped")
  200)
#+end_src

#+RESULTS:

Conditional Execution

~:if~ ~:when~ ~:unless~
~:else~
~:initially~ ~:finally~

#+begin_src lisp :results replace raw :exports both
(loop :for i :from 1 :to 10 :when (evenp i) :sum i)
#+end_src

#+RESULTS:
30 (5 bits, #x1E, #o36, #b11110)
